#### Pandas-DataFrame And Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [1]:
import pandas as pd

In [2]:
## Series
##A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

import pandas as pd
data=[1,2,3,4,5] ## list
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [1]:
import pandas as pd
data = [11,22,33,44,55]
s = pd.Series(data)
print(s)

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [5]:
## Create a Series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [6]:
data = [11,22,33,44]
inde = ['a','b','c','d']
pd.Series(data,inde)

a    11
b    22
c    33
d    44
dtype: int64

In [5]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [15]:
data=[10,20,30]
index=['a','b','c']
s = pd.Series(data,index=index)
s
#pd.DataFrame(s)

a    10
b    20
c    30
dtype: int64

In [16]:
data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}
df = pd.DataFrame(data)
df

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida

In [15]:
## Dataframe
## create a Dataframe from a dictionary oof list

data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [49]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [41]:
print(df.loc[0:2])
print(df.loc[2])

   Transaction ID        Date Product Category      Product Name  Units Sold  \
0           10001  2024-01-01      Electronics     iPhone 14 Pro           2
1           10002  2024-01-02  Home Appliances  Dyson V11 Vacuum           1
2           10003  2024-01-03         Clothing  Levi's 501 Jeans           3

   Unit Price  Total Revenue         Region Payment Method
0      999.99        1999.98  North America    Credit Card
1      499.99         499.99         Europe         PayPal
2       69.99         209.97           Asia     Debit Card
Transaction ID                 10003
Date                      2024-01-03
Product Category            Clothing
Product Name        Levi's 501 Jeans
Units Sold                         3
Unit Price                     69.99
Total Revenue                 209.97
Region                          Asia
Payment Method            Debit Card
Name: 2, dtype: object

In [42]:
print(df.loc[2,0:3])

TypeError: cannot do slice indexing on Index with these indexers [0] of type int

In [46]:
print(df.iloc[2,0:3])
print(df.loc[2:3])
print(df.loc[2:2])

Transaction ID           10003
Date                2024-01-03
Product Category      Clothing
Name: 2, dtype: object
   Transaction ID        Date Product Category       Product Name  Units Sold  \
2           10003  2024-01-03         Clothing   Levi's 501 Jeans           3
3           10004  2024-01-04            Books  The Da Vinci Code           4

   Unit Price  Total Revenue         Region Payment Method
2       69.99         209.97           Asia     Debit Card
3       15.99          63.96  North America    Credit Card
   Transaction ID        Date Product Category      Product Name  Units Sold  \
2           10003  2024-01-03         Clothing  Levi's 501 Jeans           3

   Unit Price  Total Revenue Region Payment Method
2       69.99         209.97   Asia     Debit Card

In [47]:
df.iloc[1:3,1:3]

         Date Product Category
1  2024-01-02  Home Appliances
2  2024-01-03         Clothing

In [48]:
df.iloc[0:3,0:3]

   Transaction ID        Date Product Category
0           10001  2024-01-01      Electronics
1           10002  2024-01-02  Home Appliances
2           10003  2024-01-03         Clothing

In [28]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [18]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [50]:
### Accessing Data From Dataframe
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [51]:
df['Name']

0    Krish
1     John
2    Bappy
3     JAck
Name: Name, dtype: object

In [52]:
df.loc[0]

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [53]:
df.loc[1]

Name         John
Age            34
City    Bangalore
Name: 1, dtype: object

In [54]:
df.iloc[1]

Name         John
Age            34
City    Bangalore
Name: 1, dtype: object

In [55]:
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [58]:
df.at[1,'City']

'Bangalore'

In [56]:
## Accessing a specified element
df.at[2,'Age']

32

In [36]:
df.at[2,'Name']

'Jack'

In [59]:
df.iat[1,1]

34

In [38]:
## Accessing a specified element using iat
df.iat[2,2]

'Florida'

In [39]:
df

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida

In [60]:
### Data MAnipulation with Dataframe
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [62]:
## Adding a column
df['Salary']=[50000,60000,70000,48500]
df

    Name  Age       City  Salary
0  Krish   32  Bangalore   50000
1   John   34  Bangalore   60000
2  Bappy   32  Bangalore   70000
3   JAck   32  Bangalore   48500

In [64]:
df.drop('Age',axis=1)

    Name       City  Salary
0  Krish  Bangalore   50000
1   John  Bangalore   60000
2  Bappy  Bangalore   70000
3   JAck  Bangalore   48500

In [46]:
## Remove a column
df.drop('Salary',axis=1,inplace=True)

In [47]:
df

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida

In [65]:
## Add age to the column
df['Age']=df['Age']+1
df

    Name  Age       City  Salary
0  Krish   33  Bangalore   50000
1   John   35  Bangalore   60000
2  Bappy   33  Bangalore   70000
3   JAck   33  Bangalore   48500

In [66]:
df.drop(0,inplace=True)

In [67]:
df

    Name  Age       City  Salary
1   John   35  Bangalore   60000
2  Bappy   33  Bangalore   70000
3   JAck   33  Bangalore   48500

In [68]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [69]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [70]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000